"""
Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и
возвращающую их же, но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
"""

def int_fiksik(text):
        return text.title()
print(int_fiksik("asdgh asfghd"))